Revit 2026 API

# PointLightShape(PointLightShape) Constructor

---

Creates a copy of the given point light shape

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PointLightShape(
	PointLightShape other
)
```
```vb
Public Sub New (
	other As PointLightShape
)
```
```cpp
public:
PointLightShape(
	PointLightShape^ other
)
```
```fsharp
new :
        other : PointLightShape -> PointLightShape
```

#### Parameters

other PointLightShape

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PointLightShape Class

PointLightShape Overload

Autodesk.Revit.DB.Lighting Namespace